10/data/attachments/c1ef7e8d4aeb5827.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_fbe1899d-da72-471c-9ef4-4418cf35f086</nif:username>
            <nif:friendToBeAdded>Michael_baby_Friend_49609_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>